[
    {
    "user": "LBCrisGee",
    "message": "Picked-Up PRod's white Nike Airmax at retail price!",
    "img": "image/PRod.jpg",
    "date": "7/6/2025, 2:02:00 PM,
    "replies": [
          {
            "username": "SneakerHead",
            "content": "🔥🔥🔥",
            "timestamp": "7/6/2025, 2:05:03 PM"
          }
        ]
    },
    {
    "user": "LBCrisGee",
    "message": "Why is there so much bad turbulance when trying to land in Reno?! Feels like the Universal train ride. 😪",
    "date": "7/5/2025, 11:00:00 PM"
    },
    {
    "user": "LBCrisGee",
    "message": "Jake Paul vs. Cesar Chavez Jr. Everyone wants to see Jake get knocked out and we thought the former Mexican champ would do just that, but Jake came out winning by una. decision. Cesar said Jake is a good boxer but not good enough for the current champs. Im w/Jake on this one, don't listen to anyone and make it happen!",
    "date": "6/28/2025, 9:12:00 PM"
    },
    {
    "user": "DudeWTF?1",
    "message": "Supreme Court sides w/Trump admin on nationwide injunctions in birthright citizenship case",
    "date": "6/27/2025, 12:10:00 PM"
    },
    {
    "user": "LBCrisGee",
    "message": "My exp. w/jury duty was intense—especially during the jury selection process. I was disappointed by the quality of the evidence presented. It was clear that much more could have been done to build a stronger case. The investigative work felt rushed and incomplete, reflecting a lack of effort by both the police and the state. Unfortunately, I don’t believe the individuals involved will receive any meaningful support after this. To the state, it seemed like just another case to move through the system.",
    "date": "6/24/2025, 4:05:00 PM"
    },
    {
    "user": "LBCrisGee",
    "message": "Picked-Up @theMuska newly released classic board with red griptape! #nostalgia",
    "img": "image/muska.jpg",
    "date": "6/23/2025, 6:00:00 PM"
    },
    {
    "user": "DudeWTF?!",
    "message": "Trump deploits bunker busters on Iran's nuclear facilities using B2 Bombers",
    "date": "6/22/2025, 8:20:00 PM",
     "replies": [
          {
            "username": "SomeDude",
            "content": "WW3!!!",
            "timestamp": "6/22/2025, 9:11:03 PM"
          }
        ]
    },
    {
    "user": "TahoeWeather",
    "message": "Summer officially begins!",
    "date": "6/20/2025, 12:10:00 PM"
    }
]
